# ReinforcementData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementData Class
Members See Also
---
Abstract class for various reinforcement data
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class ReinforcementData : IDisposable
```

Visual Basic
---
```text
Public Class ReinforcementData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ReinforcementData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..ReinforcementData Autodesk.Revit.DB.Structure..::..RebarReinforcementData
# See Also
ReinforcementData Members
Autodesk.Revit.DB.Structure Namespace